#pragma once
#include <map>
#include <string>

std::map<std::string, std::string> currencycodes = {
    {"AUD", "R01010"}, //Австралия
    {"ATS", "R01015"}, //Австрия 1000
    {"AZN", "R01020A"}, //Азербайджан
    {"GBP", "R01035"}, //Великобритания
    {"AON", "R01040F"}, //Ангола 100000
    {"AMD", "R01060"}, //Армения 100
    {"BYN", "R01090B"}, //Беларусь
    {"BEF", "R01095"}, //Бельгия 1000
    {"BGN", "R01100"}, //Болгария
    {"BRL", "R01115"}, //Бразилия
    {"HUF", "R01135"}, //Венгрия 100
    {"VND", "R01150"}, //Вьетнам 10000
    {"HKD", "R01200"}, //Гонконг
    {"GRD", "R01205"}, //Греция 10000
    {"GEL", "R01210"}, //Грузия
    {"DKK", "R01215"}, //Дания
    {"AED", "R01230"}, //ОАЭ
    {"USD", "R01235"}, //США
    {"EUR", "R01239"}, //Евросоюз
    {"EGP", "R01240"}, //Египет 10
    {"INR", "R01270"}, //Индия 10
    {"IDR", "R01280"}, //Индонезия 10000
    {"IEP", "R01305"}, //Ирландия 100
    {"ISK", "R01310"}, //Исландия 10000
    {"ESP", "R01315"}, //Испания 10000
    {"ITL", "R01325"}, //Италия 100000
    {"KZT", "R01335"}, //Казахстан 100
    {"CAD", "R01350"}, //Канада
    {"QAR", "R01355"}, //Катар
    {"KGS", "R01370"}, //Киргизия 10
    {"CNY", "R01375"}, //Китай
    {"KWD", "R01390"}, //Кувейт 10
    {"LVL", "R01405"}, //Латвия
    {"LBP", "R01420"}, //Ливан 100000
    {"LTL", "R01435"}, //Литва
    {"MDL", "R01500"}, //Молдавия 10
    {"DEM", "R01510"}, //Германия
    {"NLG", "R01523"}, //Нидерланды 100
    {"NZD", "R01530"}, //Новая Зеландия
    {"NOK", "R01535"}, //Норвегия 10
    {"PLN", "R01565"}, //Польша
    {"PTE", "R01570"}, //Португалия 10000
    {"RON", "R01585"}, //Румыния
    {"XDR", "R01589"}, //СДР (5 валют)
    {"SGD", "R01625"}, //Сингапур
    {"SRD", "R01665A"}, //Суринам
    {"TJS", "R01670"}, //Таджикистан 10
    {"THB", "R01675"}, //Таиланд 10
    {"TRY", "R01700J"}, //Турция 10
    {"TMT", "R01710A"}, //Туркменистан
    {"UZS", "R01717"}, //Узбекистан 10000
    {"UAH", "R01720"}, //Украина 10
    {"FIM", "R01740"}, //Финляндия 100
    {"FRF", "R01750"}, //Франция 1000
    {"CZK", "R01760"}, //Чехия 10
    {"SEK", "R01770"}, //Швеция 10
    {"CHF", "R01775"}, //Швейцария
    {"XEU", "R01790"}, //ЭКЮ
    {"EEK", "R01795"}, //Эстония 10
    {"YUN", "R01805"}, //Югославия
    {"RSD", "R01805F"}, //Сербия 100
    {"ZAR", "R01810"}, //ЮАР 10
    {"KRW", "R01815"}, //Южная Корея 1000
    {"JPY", "R01820"} //Япония 100
};

//https://www.cbr.ru/currency_base/daily/
//https://www.cbr.ru/development/SXML/